mtosi1.1-TestSuite/TestsDefinitions/OsMgr/examples/OperationsSystemMgr_getTopLevelTopologicalLink.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/OperationsSystemMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getTopLevelTopologicalLink</activityName>
			<msgName>getTopLevelTopologicalLink</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>SimpleResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getTopLevelTopologicalLink tmf854Version="1.1">
			<topoLinkName>
				<mdNm>Networks/XdrEMS/Server1</mdNm>
				<tlNm>19968/0:0:12:0:1/0:0:54016/0:0:11:0:1/layer=LR_Line_OC48_STS48_and_MS_STM16</tlNm>
			</topoLinkName>
		</getTopLevelTopologicalLink>
	</soap:Body>
</soap:Envelope>
